---
type: ToggleButtonData
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# ToggleButtonData

`Autodesk.Revit.UI.ToggleButtonData` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ToggleButtonData | — | `` |